doc/api.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2021-02-08 lun 14:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>API Progression</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Patrick Lafrance" />
<link rel="stylesheet" type="text/css" href="https://portail.dti.crosemont.quebec/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://portail.dti.crosemont.quebec/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">API Progression</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org98f0615">1. Versions</a></li>
<li><a href="#org7ff0a1a">2. Points d'entrée</a>
<ul>
<li><a href="#org4cec212">2.1. Publics</a></li>
<li><a href="#org4161451">2.2. Privés</a></li>
</ul>
</li>
<li><a href="#orgeb9138d">3. Objets</a>
<ul>
<li><a href="#org46cc986">3.1. User</a></li>
<li><a href="#org4f7a2cd">3.2. Catégorie</a></li>
<li><a href="#org4c41357">3.3. Question</a></li>
<li><a href="#org1e3760c">3.4. Solution</a></li>
<li><a href="#orgc7f35e7">3.5. Test</a></li>
</ul>
</li>
<li><a href="#orgc21a117">4. Exemples</a>
<ul>
<li><a href="#orge602f68">4.1. Connexion en tant qu'utilisateur <code>test</code> :</a></li>
<li><a href="#orge7a584b">4.2. Obtenir le profil de l'utilisateur connecté <code>test</code> :</a></li>
<li><a href="#org6f8cf2c">4.3. Obtenir la liste des catégories disponibles pour l'utilisateur <code>test</code> :</a></li>
<li><a href="#org9845db0">4.4. Obtenir la catégorie «programmation_1» :</a></li>
<li><a href="#orga962c34">4.5. Obtenir la question «appeler_une_fonction» :</a></li>
<li><a href="#org9046d40">4.6. Obtenir l'ébauche de solution en Python pour question «appeler_une_fonction» :</a></li>
<li><a href="#org1129265">4.7. Soumettre une solution à la question «appeler_une_fonction» :</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org98f0615" class="outline-2">
<h2 id="org98f0615"><span class="section-number-2">1</span> Versions</h2>
<div class="outline-text-2" id="text-1">
<p>
Les versions de l'api sont accessibles à des URL distincts pour assurer la rétrocompatibilité.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Version</td>
<td class="org-left">URL</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left"><code>/api/v1/</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7ff0a1a" class="outline-2">
<h2 id="org7ff0a1a"><span class="section-number-2">2</span> Points d'entrée</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4cec212" class="outline-3">
<h3 id="org4cec212"><span class="section-number-3">2.1</span> Publics</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Méthode</td>
<td class="org-left">URL</td>
<td class="org-left">Description</td>
<td class="org-left">Paramètres</td>
<td class="org-left">Réponse</td>
</tr>

<tr>
<td class="org-left">GET</td>
<td class="org-left"><code>/doc</code></td>
<td class="org-left">Documentation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">str (HTML)</td>
</tr>

<tr>
<td class="org-left">POST</td>
<td class="org-left"><code>/auth</code></td>
<td class="org-left">Authentification</td>
<td class="org-left">username, password</td>
<td class="org-left">token, un token JWT</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4161451" class="outline-3">
<h3 id="org4161451"><span class="section-number-3">2.2</span> Privés</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Les points d'entrée privés requierent un token dans l'entête : «Authentification: Bearer &lt;token&gt;»
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Méthode</td>
<td class="org-left">URL</td>
<td class="org-left">Description</td>
<td class="org-left">Réponse</td>
</tr>

<tr>
<td class="org-left">GET</td>
<td class="org-left"><code>/user/</code></td>
<td class="org-left">Obtient l'utilisateur Authentification</td>
<td class="org-left">User</td>
</tr>

<tr>
<td class="org-left">GET</td>
<td class="org-left"><code>/user/{username}</code></td>
<td class="org-left">Obtient l'utilisateur <i>username</i></td>
<td class="org-left">User</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgeb9138d" class="outline-2">
<h2 id="orgeb9138d"><span class="section-number-2">3</span> Objets</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org46cc986" class="outline-3">
<h3 id="org46cc986"><span class="section-number-3">3.1</span> User</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Classe</th>
<th scope="col" class="org-left">Identifiant</th>
<th scope="col" class="org-left">Propriétés</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Valeurs</th>
<th scope="col" class="org-left">Liens</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">User</td>
<td class="org-left">username</td>
<td class="org-left">username</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">catégories</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">rôle</td>
<td class="org-left">int</td>
<td class="org-left">0=normal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1=admin</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4f7a2cd" class="outline-3">
<h3 id="org4f7a2cd"><span class="section-number-3">3.2</span> Catégorie</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Classe</th>
<th scope="col" class="org-left">Identifiant</th>
<th scope="col" class="org-left">Propriétés</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Valeurs</th>
<th scope="col" class="org-left">Liens</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Catégorie</td>
<td class="org-left">parent/nom</td>
<td class="org-left">nom</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">parent</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">titre</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">catégories</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">description</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">questions</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">avancement</td>
<td class="org-left">float</td>
<td class="org-left">0-100%</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">accessible</td>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4c41357" class="outline-3">
<h3 id="org4c41357"><span class="section-number-3">3.3</span> Question</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Classe</th>
<th scope="col" class="org-left">Identifiant</th>
<th scope="col" class="org-left">Propriétés</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Valeurs</th>
<th scope="col" class="org-left">Liens</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Question</td>
<td class="org-left">catégorie/nom</td>
<td class="org-left">nom</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">suivante</td>
</tr>

<tr>
<td class="org-left">▲</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">titre</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">catégorie</td>
</tr>

<tr>
<td class="org-left">│</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">description</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ébauches</td>
</tr>

<tr>
<td class="org-left">│</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">énoncé</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">solutions</td>
</tr>

<tr>
<td class="org-left">│</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">avancement</td>
<td class="org-left">int</td>
<td class="org-left">DÉBUT(0),NON-RÉUSSI(1),RÉUSSI(2)</td>
<td class="org-left">tests</td>
</tr>

<tr>
<td class="org-left">│</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">type</td>
<td class="org-left">int</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">├ QuestionProg</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">├ QuestionProgEval(obsolète)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">├ QuestionSys</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">└ QuestionBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">image</td>
<td class="org-left">str</td>
<td class="org-left">SHA256</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">user</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">vérification</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1e3760c" class="outline-3">
<h3 id="org1e3760c"><span class="section-number-3">3.4</span> Solution</h3>
<div class="outline-text-3" id="text-3-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Classe</th>
<th scope="col" class="org-left">Identifiant</th>
<th scope="col" class="org-left">Propriétés</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Valeurs</th>
<th scope="col" class="org-left">Liens</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Solution</td>
<td class="org-left">question/date_soumission</td>
<td class="org-left">date_soumission</td>
<td class="org-left">timestamp</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">question</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">langage</td>
<td class="org-left">int</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">code</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">feedback</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc7f35e7" class="outline-3">
<h3 id="orgc7f35e7"><span class="section-number-3">3.5</span> Test</h3>
<div class="outline-text-3" id="text-3-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Classe</th>
<th scope="col" class="org-left">Identifiant</th>
<th scope="col" class="org-left">Propriétés</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Valeurs</th>
<th scope="col" class="org-left">Liens</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Test</td>
<td class="org-left">question/numéro</td>
<td class="org-left">numéro</td>
<td class="org-left">int</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">question</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">nom</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">entrée</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sortie_attendue</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sortie_observée</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sortie_erreur</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">résultat</td>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">feedback</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgc21a117" class="outline-2">
<h2 id="orgc21a117"><span class="section-number-2">4</span> Exemples</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge602f68" class="outline-3">
<h3 id="orge602f68"><span class="section-number-3">4.1</span> Connexion en tant qu'utilisateur <code>test</code> :</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cc6666;">PASSWORD</span>=$(<span style="color: #c5c8c6; font-weight: bold;">cat</span> ./mot_de_passe)
curl https://progression.dti.crosemont.quebec/api/v1/auth --data <span style="color: #b5bd68;">"username=test&amp;password=$PASSWORD"</span> 
</pre>
</div>

<pre class="example">
{"token":"eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VyIjp7InVzZXJuYW1lIjoidGVzdCIsInJvbGUiOjAsImlkIjozLCJhY3RpZiI6bnVsbH0sImN1cnJlbnQiOjE2MTI4MDkxMDcsImV4cGlyZWQiOjE2MTI4OTU1MDd9.hL_-G4bfNjaVuSku6Ed05UsE54IaQrDskRWq_HUQ8PA"}
</pre>
</div>
</div>

<div id="outline-container-orge7a584b" class="outline-3">
<h3 id="orge7a584b"><span class="section-number-3">4.2</span> Obtenir le profil de l'utilisateur connecté <code>test</code> :</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh">curl https://progression.dti.crosemont.quebec/api/v1/user -H <span style="color: #b5bd68;">"Authorization: Bearer $TOKEN"</span>
</pre>
</div>

<pre class="example">
{
  "user": {
    "username": "test",
    "rôle": 0
  }
}
</pre>
</div>
</div>

<div id="outline-container-org6f8cf2c" class="outline-3">
<h3 id="org6f8cf2c"><span class="section-number-3">4.3</span> Obtenir la liste des catégories disponibles pour l'utilisateur <code>test</code> :</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh">curl https://progression.dti.crosemont.quebec/api/v1/user?links -H <span style="color: #b5bd68;">"Authorization: Bearer $TOKEN"</span>
</pre>
</div>

<pre class="example">
{
  "user": {
    "username": "test",
    "rôle": 0
  },
  "links": {
    "catégories": [
      "/catégorie/tutoriel",
      "/catégorie/programmation_1"
    ]
  }
}
</pre>
</div>
</div>


<div id="outline-container-org9845db0" class="outline-3">
<h3 id="org9845db0"><span class="section-number-3">4.4</span> Obtenir la catégorie «programmation_1» :</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-sh">curl https://progression.dti.crosemont.quebec/api/v1/cat&#233;gorie/programmation_1&amp;links -H <span style="color: #b5bd68;">"Authorization: Bearer $TOKEN"</span>
</pre>
</div>

<pre class="example">
{
  "catégorie": {
    "nom": "programmation_1",
    "titre": "Introduction à la programmation",
    "description": "Exercices d'introduction à la programmation.",
    "avancement": "42",
    "accessible": "true"
  },
  "links": {
    "parent": "/",
    "catégories": [
      "/catégorie/programmation_1/les_boucles",
      "/catégorie/programmation_1/les_fonctions"
    ],
    "questions": [
      "question/programmation_1/les_fonctions/appeler_une_fonction"
    ]
  }
}
</pre>
</div>
</div>

<div id="outline-container-orga962c34" class="outline-3">
<h3 id="orga962c34"><span class="section-number-3">4.5</span> Obtenir la question «appeler_une_fonction» :</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-sh">curl https://progression.dti.crosemont.quebec/api/v1/question/programmation_1/les_fonctions/appeler_une_fonction -H <span style="color: #b5bd68;">"Authorization: Bearer $TOKEN"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9046d40" class="outline-3">
<h3 id="org9046d40"><span class="section-number-3">4.6</span> Obtenir l'ébauche de solution en Python pour question «appeler_une_fonction» :</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-sh">curl https://progression.dti.crosemont.quebec/api/v1/solution/programmation_1/les_fonctions/appeler_une_fonction?<span style="color: #cc6666;">langage</span>=python -H <span style="color: #b5bd68;">"Authorization: Bearer $TOKEN"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1129265" class="outline-3">
<h3 id="org1129265"><span class="section-number-3">4.7</span> Soumettre une solution à la question «appeler_une_fonction» :</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-sh">curl --data <span style="color: #b5bd68;">'{"langage":"python", "code":"ma_fonction(\"Allo le monde\")"  }'</span> https://progression.dti.crosemont.quebec/api/v1/solution/programmation_1/les_fonctions/appeler_une_fonction -H <span style="color: #b5bd68;">"Authorization: Bearer $TOKEN"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Patrick Lafrance</p>
<p class="date">Created: 2021-02-08 lun 14:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
